Revit 2024 API
DividedPath.IsValidMeasurementType Method
 Checks that the measurement type enumeration value is valid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsValidMeasurementType(
	DividedPathMeasurementType measurementType
)
Visual Basic
Public Function IsValidMeasurementType ( _
	measurementType As DividedPathMeasurementType _
) As Boolean
Visual C++
public:
bool IsValidMeasurementType(
	DividedPathMeasurementType measurementType
)
Parameters
measurementType
Type: Autodesk.Revit.DB.DividedPathMeasurementType
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
DividedPath Class
Autodesk.Revit.DB Namespace